---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.IPipePressureDropServer
source: html/95caf06c-0c37-b948-31c9-be0ff0a97ed4.htm
---
# IPipePressureDropServer Methods

Calculate the pipe pressure drop.